Revit 2024 API
Space.DesignHVACLoadperArea Property
Get or set the Design HVAC Load per Area of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double DesignHVACLoadperArea { get; set; }
Visual Basic
Public Property DesignHVACLoadperArea As Double
	Get
	Set
Visual C++
public:
property double DesignHVACLoadperArea {
	double get ();
	void set (double value);
}
Remarks
This property is used to get or set the Design HVAC Load per Area (Unit: W/ft2) of the Space.
See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace